Revit 2024 API
ParameterTypeId.StructuralAttachmentEndValueRatio Property
 "End attachment ratio"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralAttachmentEndValueRatio { get; }
Visual Basic
Public Shared ReadOnly Property StructuralAttachmentEndValueRatio As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralAttachmentEndValueRatio {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace